GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32g5x3c(e)xx-pinctrl.h
/* CLAIN12 */
#define CLAIN12_PA9 \
	GD32_PINMUX_AF('A', 9, ANALOG)

/* CLAIN13 */
#define CLAIN13_PA10 \
	GD32_PINMUX_AF('A', 10, ANALOG)

/* CLAIN14 */
#define CLAIN14_PA11 \
	GD32_PINMUX_AF('A', 11, ANALOG)

/* CLAIN15 */
#define CLAIN15_PA12 \
	GD32_PINMUX_AF('A', 12, ANALOG)

/* CLAIN16 */
#define CLAIN16_PF0 \
	GD32_PINMUX_AF('F', 0, ANALOG)

/* CLAIN17 */
#define CLAIN17_PF1 \
	GD32_PINMUX_AF('F', 1, ANALOG)

/* CLAIN18 */
#define CLAIN18_PA0 \
	GD32_PINMUX_AF('A', 0, ANALOG)

/* CLAIN19 */
#define CLAIN19_PA1 \
	GD32_PINMUX_AF('A', 1, ANALOG)

/* CLAIN2 */
#define CLAIN2_PB4 \
	GD32_PINMUX_AF('B', 4, ANALOG)

/* CLAIN3 */
#define CLAIN3_PB5 \
	GD32_PINMUX_AF('B', 5, ANALOG)

/* CLAIN4 */
#define CLAIN4_PB6 \
	GD32_PINMUX_AF('B', 6, ANALOG)

/* CLAIN5 */
#define CLAIN5_PB7 \
	GD32_PINMUX_AF('B', 7, ANALOG)

/* CLAIN6 */
#define CLAIN6_PB8 \
	GD32_PINMUX_AF('B', 8, ANALOG)

/* CLAIN7 */
#define CLAIN7_PB9 \
	GD32_PINMUX_AF('B', 9, ANALOG)

/* CLAIN8 */
#define CLAIN8_PB0 \
	GD32_PINMUX_AF('B', 0, ANALOG)

/* CLAIN9 */
#define CLAIN9_PB1 \
	GD32_PINMUX_AF('B', 1, ANALOG)

/* CMP0_IM */
#define CMP0_IM_PA0 \
	GD32_PINMUX_AF('A', 0, ANALOG)
#define CMP0_IM_PA4 \
	GD32_PINMUX_AF('A', 4, ANALOG)

/* CMP0_IP */
#define CMP0_IP_PA1 \
	GD32_PINMUX_AF('A', 1, ANALOG)
#define CMP0_IP_PB1 \
	GD32_PINMUX_AF('B', 1, ANALOG)

/* CMP0_OUT */
#define CMP0_OUT_PA0 \
	GD32_PINMUX_AF('A', 0, AF8)
#define CMP0_OUT_PA6 \
	GD32_PINMUX_AF('A', 6, AF8)
#define CMP0_OUT_PA11 \
	GD32_PINMUX_AF('A', 11, AF8)
#define CMP0_OUT_PB8 \
	GD32_PINMUX_AF('B', 8, AF8)

/* CMP1_IM */
#define CMP1_IM_PA2 \
	GD32_PINMUX_AF('A', 2, ANALOG)
#define CMP1_IM_PA5 \
	GD32_PINMUX_AF('A', 5, ANALOG)

/* CMP1_IP */
#define CMP1_IP_PA3 \
	GD32_PINMUX_AF('A', 3, ANALOG)
#define CMP1_IP_PA7 \
	GD32_PINMUX_AF('A', 7, ANALOG)

/* CMP1_OUT */
#define CMP1_OUT_PA2 \
	GD32_PINMUX_AF('A', 2, AF8)
#define CMP1_OUT_PA7 \
	GD32_PINMUX_AF('A', 7, AF8)
#define CMP1_OUT_PA12 \
	GD32_PINMUX_AF('A', 12, AF8)
#define CMP1_OUT_PB9 \
	GD32_PINMUX_AF('B', 9, AF8)

/* CMP2_IM */
#define CMP2_IM_PF1 \
	GD32_PINMUX_AF('F', 1, ANALOG)

/* CMP2_IP */
#define CMP2_IP_PA0 \
	GD32_PINMUX_AF('A', 0, ANALOG)

/* CMP2_OUT */
#define CMP2_OUT_PB7 \
	GD32_PINMUX_AF('B', 7, AF8)
#define CMP2_OUT_PB15 \
	GD32_PINMUX_AF('B', 15, AF3)

/* CMP3_IM */
#define CMP3_IM_PB2 \
	GD32_PINMUX_AF('B', 2, ANALOG)

/* CMP3_IP */
#define CMP3_IP_PB0 \
	GD32_PINMUX_AF('B', 0, ANALOG)

/* CMP3_OUT */
#define CMP3_OUT_PB1 \
	GD32_PINMUX_AF('B', 1, AF8)
#define CMP3_OUT_PB6 \
	GD32_PINMUX_AF('B', 6, AF8)
#define CMP3_OUT_PB14 \
	GD32_PINMUX_AF('B', 14, AF8)

/* CMP4_IM */
#define CMP4_IM_PB10 \
	GD32_PINMUX_AF('B', 10, ANALOG)

/* CMP4_IP */
#define CMP4_IP_PB13 \
	GD32_PINMUX_AF('B', 13, ANALOG)

/* CMP4_OUT */
#define CMP4_OUT_PA9 \
	GD32_PINMUX_AF('A', 9, AF8)

/* CMP5_IM */
#define CMP5_IM_PB15 \
	GD32_PINMUX_AF('B', 15, ANALOG)

/* CMP5_IP */
#define CMP5_IP_PB11 \
	GD32_PINMUX_AF('B', 11, ANALOG)

/* CMP5_OUT */
#define CMP5_OUT_PA10 \
	GD32_PINMUX_AF('A', 10, AF8)
#define CMP5_OUT_PC6 \
	GD32_PINMUX_AF('C', 6, AF7)

/* CMP6_IM */
#define CMP6_IM_PB12 \
	GD32_PINMUX_AF('B', 12, ANALOG)

/* CMP6_IP */
#define CMP6_IP_PB14 \
	GD32_PINMUX_AF('B', 14, ANALOG)

/* CMP6_OUT */
#define CMP6_OUT_PA8 \
	GD32_PINMUX_AF('A', 8, AF8)

/* CMP7_OUT */
#define CMP7_OUT_PA13 \
	GD32_PINMUX_AF('A', 13, AF8)
#define CMP7_OUT_PA14 \
	GD32_PINMUX_AF('A', 14, AF8)

/* DAC0_OUT0 */
#define DAC0_OUT0_PA4 \
	GD32_PINMUX_AF('A', 4, ANALOG)

/* DAC0_OUT1 */
#define DAC0_OUT1_PA5 \
	GD32_PINMUX_AF('A', 5, ANALOG)

/* DAC1_OUT0 */
#define DAC1_OUT0_PA6 \
	GD32_PINMUX_AF('A', 6, ANALOG)

/* DAC1_OUT1 */
#define DAC1_OUT1_PA7 \
	GD32_PINMUX_AF('A', 7, ANALOG)

/* EVENTOUT */
#define EVENTOUT_PA0 \
	GD32_PINMUX_AF('A', 0, AF15)
#define EVENTOUT_PA1 \
	GD32_PINMUX_AF('A', 1, AF15)
#define EVENTOUT_PA2 \
	GD32_PINMUX_AF('A', 2, AF15)
#define EVENTOUT_PA3 \
	GD32_PINMUX_AF('A', 3, AF15)
#define EVENTOUT_PA4 \
	GD32_PINMUX_AF('A', 4, AF15)
#define EVENTOUT_PA5 \
	GD32_PINMUX_AF('A', 5, AF15)
#define EVENTOUT_PA6 \
	GD32_PINMUX_AF('A', 6, AF15)
#define EVENTOUT_PA7 \
	GD32_PINMUX_AF('A', 7, AF15)
#define EVENTOUT_PA8 \
	GD32_PINMUX_AF('A', 8, AF15)
#define EVENTOUT_PA9 \
	GD32_PINMUX_AF('A', 9, AF15)
#define EVENTOUT_PA10 \
	GD32_PINMUX_AF('A', 10, AF15)
#define EVENTOUT_PA11 \
	GD32_PINMUX_AF('A', 11, AF15)
#define EVENTOUT_PA12 \
	GD32_PINMUX_AF('A', 12, AF15)
#define EVENTOUT_PA13 \
	GD32_PINMUX_AF('A', 13, AF15)
#define EVENTOUT_PA14 \
	GD32_PINMUX_AF('A', 14, AF15)
#define EVENTOUT_PA15 \
	GD32_PINMUX_AF('A', 15, AF15)
#define EVENTOUT_PB0 \
	GD32_PINMUX_AF('B', 0, AF15)
#define EVENTOUT_PB1 \
	GD32_PINMUX_AF('B', 1, AF15)
#define EVENTOUT_PB2 \
	GD32_PINMUX_AF('B', 2, AF15)
#define EVENTOUT_PB3 \
	GD32_PINMUX_AF('B', 3, AF15)
#define EVENTOUT_PB4 \
	GD32_PINMUX_AF('B', 4, AF15)
#define EVENTOUT_PB5 \
	GD32_PINMUX_AF('B', 5, AF15)
#define EVENTOUT_PB6 \
	GD32_PINMUX_AF('B', 6, AF15)
#define EVENTOUT_PB7 \
	GD32_PINMUX_AF('B', 7, AF15)
#define EVENTOUT_PB8 \
	GD32_PINMUX_AF('B', 8, AF15)
#define EVENTOUT_PB9 \
	GD32_PINMUX_AF('B', 9, AF15)
#define EVENTOUT_PB10 \
	GD32_PINMUX_AF('B', 10, AF15)
#define EVENTOUT_PB11 \
	GD32_PINMUX_AF('B', 11, AF15)
#define EVENTOUT_PB12 \
	GD32_PINMUX_AF('B', 12, AF15)
#define EVENTOUT_PB13 \
	GD32_PINMUX_AF('B', 13, AF15)
#define EVENTOUT_PB14 \
	GD32_PINMUX_AF('B', 14, AF15)
#define EVENTOUT_PB15 \
	GD32_PINMUX_AF('B', 15, AF15)
#define EVENTOUT_PC4 \
	GD32_PINMUX_AF('C', 4, AF15)
#define EVENTOUT_PC6 \
	GD32_PINMUX_AF('C', 6, AF15)
#define EVENTOUT_PC10 \
	GD32_PINMUX_AF('C', 10, AF15)
#define EVENTOUT_PC11 \
	GD32_PINMUX_AF('C', 11, AF15)
#define EVENTOUT_PC12 \
	GD32_PINMUX_AF('C', 12, AF15)
#define EVENTOUT_PC13 \
	GD32_PINMUX_AF('C', 13, AF15)
#define EVENTOUT_PC14 \
	GD32_PINMUX_AF('C', 14, AF15)
#define EVENTOUT_PC15 \
	GD32_PINMUX_AF('C', 15, AF15)
#define EVENTOUT_PF0 \
	GD32_PINMUX_AF('F', 0, AF15)
#define EVENTOUT_PF1 \
	GD32_PINMUX_AF('F', 1, AF15)
#define EVENTOUT_PG10 \
	GD32_PINMUX_AF('G', 10, AF15)

/* EXMC_A0 */
#define EXMC_A0_PC12 \
	GD32_PINMUX_AF('C', 12, AF12)

