GD32-MCU-IOT/hal_gigadevice_zephyr/include/dt-bindings/pinctrl/gd32g5x3c(e)xx-pinctrl.h
/* TIMER0_CH1 */
#define TIMER0_CH1_PA9 \
	GD32_PINMUX_AF('A', 9, AF6)

/* TIMER0_CH2 */
#define TIMER0_CH2_PA10 \
	GD32_PINMUX_AF('A', 10, AF6)

/* TIMER0_CH3 */
#define TIMER0_CH3_PA11 \
	GD32_PINMUX_AF('A', 11, AF11)

/* TIMER0_ETI */
#define TIMER0_ETI_PA12 \
	GD32_PINMUX_AF('A', 12, AF11)
#define TIMER0_ETI_PC4 \
	GD32_PINMUX_AF('C', 4, AF2)

/* TIMER0_MCH0 */
#define TIMER0_MCH0_PA7 \
	GD32_PINMUX_AF('A', 7, AF6)
#define TIMER0_MCH0_PA11 \
	GD32_PINMUX_AF('A', 11, AF6)
#define TIMER0_MCH0_PB13 \
	GD32_PINMUX_AF('B', 13, AF6)
#define TIMER0_MCH0_PC13 \
	GD32_PINMUX_AF('C', 13, AF4)

/* TIMER0_MCH1 */
#define TIMER0_MCH1_PA12 \
	GD32_PINMUX_AF('A', 12, AF6)
#define TIMER0_MCH1_PB0 \
	GD32_PINMUX_AF('B', 0, AF6)
#define TIMER0_MCH1_PB14 \
	GD32_PINMUX_AF('B', 14, AF6)

/* TIMER0_MCH2 */
#define TIMER0_MCH2_PB1 \
	GD32_PINMUX_AF('B', 1, AF6)
#define TIMER0_MCH2_PB9 \
	GD32_PINMUX_AF('B', 9, AF12)
#define TIMER0_MCH2_PB15 \
	GD32_PINMUX_AF('B', 15, AF6)
#define TIMER0_MCH2_PF0 \
	GD32_PINMUX_AF('F', 0, AF6)

/* TIMER14_BRKIN0 */
#define TIMER14_BRKIN0_PA9 \
	GD32_PINMUX_AF('A', 9, AF9)

/* TIMER14_CH0 */
#define TIMER14_CH0_PA2 \
	GD32_PINMUX_AF('A', 2, AF9)
#define TIMER14_CH0_PB14 \
	GD32_PINMUX_AF('B', 14, AF1)

/* TIMER14_CH1 */
#define TIMER14_CH1_PA3 \
	GD32_PINMUX_AF('A', 3, AF9)
#define TIMER14_CH1_PB15 \
	GD32_PINMUX_AF('B', 15, AF1)

/* TIMER14_MCH0 */
#define TIMER14_MCH0_PA1 \
	GD32_PINMUX_AF('A', 1, AF9)
#define TIMER14_MCH0_PB15 \
	GD32_PINMUX_AF('B', 15, AF2)

/* TIMER15_BRKIN0 */
#define TIMER15_BRKIN0_PB5 \
	GD32_PINMUX_AF('B', 5, AF1)

/* TIMER15_CH0 */
#define TIMER15_CH0_PA6 \
	GD32_PINMUX_AF('A', 6, AF1)
#define TIMER15_CH0_PA12 \
	GD32_PINMUX_AF('A', 12, AF1)
#define TIMER15_CH0_PB4 \
	GD32_PINMUX_AF('B', 4, AF1)
#define TIMER15_CH0_PB8 \
	GD32_PINMUX_AF('B', 8, AF1)

/* TIMER15_MCH0 */
#define TIMER15_MCH0_PA13 \
	GD32_PINMUX_AF('A', 13, AF1)
#define TIMER15_MCH0_PB6 \
	GD32_PINMUX_AF('B', 6, AF1)

/* TIMER16_BRKIN0 */
#define TIMER16_BRKIN0_PA10 \
	GD32_PINMUX_AF('A', 10, AF1)
#define TIMER16_BRKIN0_PB4 \
	GD32_PINMUX_AF('B', 4, AF10)

/* TIMER16_CH0 */
#define TIMER16_CH0_PA7 \
	GD32_PINMUX_AF('A', 7, AF1)
#define TIMER16_CH0_PB5 \
	GD32_PINMUX_AF('B', 5, AF10)
#define TIMER16_CH0_PB9 \
	GD32_PINMUX_AF('B', 9, AF1)

/* TIMER16_MCH0 */
#define TIMER16_MCH0_PB7 \
	GD32_PINMUX_AF('B', 7, AF1)

/* TIMER19_BRKIN1 */
#define TIMER19_BRKIN1_PF1 \
	GD32_PINMUX_AF('F', 1, AF2)

/* TIMER19_CH0 */
#define TIMER19_CH0_PB2 \
	GD32_PINMUX_AF('B', 2, AF3)

/* TIMER19_MCH0 */
#define TIMER19_MCH0_PB1 \
	GD32_PINMUX_AF('B', 1, AF7)

/* TIMER1_CH0 */
#define TIMER1_CH0_PA0 \
	GD32_PINMUX_AF('A', 0, AF1)
#define TIMER1_CH0_PA5 \
	GD32_PINMUX_AF('A', 5, AF1)
#define TIMER1_CH0_PA15 \
	GD32_PINMUX_AF('A', 15, AF1)

/* TIMER1_CH1 */
#define TIMER1_CH1_PA1 \
	GD32_PINMUX_AF('A', 1, AF1)
#define TIMER1_CH1_PB3 \
	GD32_PINMUX_AF('B', 3, AF1)

/* TIMER1_CH2 */
#define TIMER1_CH2_PA2 \
	GD32_PINMUX_AF('A', 2, AF1)
#define TIMER1_CH2_PA9 \
	GD32_PINMUX_AF('A', 9, AF10)
#define TIMER1_CH2_PB10 \
	GD32_PINMUX_AF('B', 10, AF1)

/* TIMER1_CH3 */
#define TIMER1_CH3_PA3 \
	GD32_PINMUX_AF('A', 3, AF1)
#define TIMER1_CH3_PA10 \
	GD32_PINMUX_AF('A', 10, AF10)
#define TIMER1_CH3_PB11 \
	GD32_PINMUX_AF('B', 11, AF1)

/* TIMER1_ETI */
#define TIMER1_ETI_PA0 \
	GD32_PINMUX_AF('A', 0, AF14)
#define TIMER1_ETI_PA5 \
	GD32_PINMUX_AF('A', 5, AF1)
#define TIMER1_ETI_PA15 \
	GD32_PINMUX_AF('A', 15, AF14)

/* TIMER2_CH0 */
#define TIMER2_CH0_PA6 \
	GD32_PINMUX_AF('A', 6, AF2)
#define TIMER2_CH0_PB4 \
	GD32_PINMUX_AF('B', 4, AF2)
#define TIMER2_CH0_PC6 \
	GD32_PINMUX_AF('C', 6, AF2)

/* TIMER2_CH1 */
#define TIMER2_CH1_PA4 \
	GD32_PINMUX_AF('A', 4, AF2)
#define TIMER2_CH1_PA7 \
	GD32_PINMUX_AF('A', 7, AF2)
#define TIMER2_CH1_PB5 \
	GD32_PINMUX_AF('B', 5, AF2)

/* TIMER2_CH2 */
#define TIMER2_CH2_PB0 \
	GD32_PINMUX_AF('B', 0, AF2)

/* TIMER2_CH3 */
#define TIMER2_CH3_PB1 \
	GD32_PINMUX_AF('B', 1, AF2)
#define TIMER2_CH3_PB7 \
	GD32_PINMUX_AF('B', 7, AF10)

/* TIMER2_ETI */
#define TIMER2_ETI_PB3 \
	GD32_PINMUX_AF('B', 3, AF10)

/* TIMER3_CH0 */
#define TIMER3_CH0_PA11 \
	GD32_PINMUX_AF('A', 11, AF10)
#define TIMER3_CH0_PB6 \
	GD32_PINMUX_AF('B', 6, AF2)

/* TIMER3_CH1 */
#define TIMER3_CH1_PA12 \
	GD32_PINMUX_AF('A', 12, AF10)
#define TIMER3_CH1_PB7 \
	GD32_PINMUX_AF('B', 7, AF2)

/* TIMER3_CH2 */
#define TIMER3_CH2_PA13 \
	GD32_PINMUX_AF('A', 13, AF10)
#define TIMER3_CH2_PB8 \
	GD32_PINMUX_AF('B', 8, AF2)

/* TIMER3_CH3 */
#define TIMER3_CH3_PB9 \
	GD32_PINMUX_AF('B', 9, AF2)

/* TIMER3_ETI */
#define TIMER3_ETI_PA8 \
	GD32_PINMUX_AF('A', 8, AF10)
#define TIMER3_ETI_PB3 \
	GD32_PINMUX_AF('B', 3, AF2)

/* TIMER4_CH0 */
#define TIMER4_CH0_PA0 \
	GD32_PINMUX_AF('A', 0, AF2)
#define TIMER4_CH0_PB2 \
	GD32_PINMUX_AF('B', 2, AF2)

/* TIMER4_CH1 */
#define TIMER4_CH1_PA1 \
	GD32_PINMUX_AF('A', 1, AF2)
#define TIMER4_CH1_PC12 \
	GD32_PINMUX_AF('C', 12, AF1)

/* TIMER4_CH2 */
#define TIMER4_CH2_PA2 \
	GD32_PINMUX_AF('A', 2, AF2)

/* TIMER4_CH3 */
#define TIMER4_CH3_PA3 \
	GD32_PINMUX_AF('A', 3, AF2)

/* TIMER4_ETI */
#define TIMER4_ETI_PB12 \
	GD32_PINMUX_AF('B', 12, AF2)

/* TIMER7_BRKIN0 */
#define TIMER7_BRKIN0_PA0 \
	GD32_PINMUX_AF('A', 0, AF9)
#define TIMER7_BRKIN0_PA6 \
	GD32_PINMUX_AF('A', 6, AF4)
#define TIMER7_BRKIN0_PA10 \
	GD32_PINMUX_AF('A', 10, AF11)
#define TIMER7_BRKIN0_PB7 \
	GD32_PINMUX_AF('B', 7, AF5)

/* TIMER7_BRKIN1 */
#define TIMER7_BRKIN1_PA13 \
	GD32_PINMUX_AF('A', 13, AF6)

/* TIMER7_BRKIN2 */
#define TIMER7_BRKIN2_PB6 \
	GD32_PINMUX_AF('B', 6, AF10)

/* TIMER7_CH0 */
#define TIMER7_CH0_PA15 \
	GD32_PINMUX_AF('A', 15, AF3)
#define TIMER7_CH0_PB6 \
	GD32_PINMUX_AF('B', 6, AF5)
#define TIMER7_CH0_PC6 \
	GD32_PINMUX_AF('C', 6, AF4)

/* TIMER7_CH1 */
#define TIMER7_CH1_PA14 \
	GD32_PINMUX_AF('A', 14, AF6)
#define TIMER7_CH1_PB8 \
	GD32_PINMUX_AF('B', 8, AF10)

/* TIMER7_CH2 */
#define TIMER7_CH2_PB9 \
	GD32_PINMUX_AF('B', 9, AF10)

/* TIMER7_ETI */
#define TIMER7_ETI_PA0 \
	GD32_PINMUX_AF('A', 0, AF10)
#define TIMER7_ETI_PB6 \
	GD32_PINMUX_AF('B', 6, AF5)

